**Chapter 01 Getting Started with Scala**

<!-- vim-markdown-toc GFM -->

* [Why Scala?](#why-scala)
    * [A Concise Language](#a-concise-language)
    * [Lightweight Syntax](#lightweight-syntax)
    * [Multiparadigm Language](#multiparadigm-language)
        * [Object-Oriented Language](#object-oriented-language)
        * [Functional Language](#functional-language)
    * [Interoperability and Seamless Integration with Java](#interoperability-and-seamless-integration-with-java)
    * [Language for the Java Virtual Machine](#language-for-the-java-virtual-machine)
* [Installing Scala](#installing-scala)
* [Scala at the Command Line and Scala Scripts](#scala-at-the-command-line-and-scala-scripts)
    * [Interactive Scala](#interactive-scala)
    * [Scala Scripts](#scala-scripts)
    * [Compiling Scala Programs](#compiling-scala-programs)
* [Your First Scala Programs](#your-first-scala-programs)
    * [Hello World](#hello-world)
    * [Printing Some Numbers](#printing-some-numbers)

<!-- vim-markdown-toc -->
# Why Scala?

## A Concise Language

简明的语法。


一段 Java 代码:
```java
class Book {
  private String title;
  private int numberOfPages;

  public Book(String title, int numberOfPages) {
    this.title = title;
    this.numberOfPages = numberOfPages;
  }
}
```


Scala 中同样的实现：
```scala
class Book(title:String, numberOfPages:Int)
```
## Lightweight Syntax
Scala 不会包含没有用的，甚至是烦人的 Java 特性，比如 static members, primitive, break, continue 等语法。


Scala 语法的轻量级主要体现在：
- 不采取“一刀切”，而是旨在用户工具自己的需求来构建程序。
- 包含类似类型借口和 APIs 扩展。

*Case* 类等价于 Java 的 POJOs，这将在第三章介绍。*Case* 类自带了 Java POJOs 的 `getter`, `setter`, `equals` , `hashCode`, `toString` 方法。

Scala 中轻量级的 POJOs 代码：
```scala
case class Book(var title: String, var numberOfPages: Int)
```

这时，我们可以编译它，然后生成 `Book.class` 和 `Book$.class`：
```
> scalac Book.scala
> javap Book
```
内容如下：
```java
public class Book implements scala.Product,java.io.Serializable {
  public static scala.Option<scala.Tuple2<java.lang.String, java.lang.Object>> unapply(Book);
  public static Book apply(java.lang.String, int);
  public static scala.Function1<scala.Tuple2<java.lang.String, java.lang.Object>, Book> tupled();
  public static scala.Function1<java.lang.String, scala.Function1<java.lang.Object, Book>> curried();
  public scala.collection.Iterator<java.lang.String> productElementNames();
  public java.lang.String title();
  public void title_$eq(java.lang.String);
  public int numberOfPages();
  public void numberOfPages_$eq(int);
  public Book copy(java.lang.String, int);
  public java.lang.String copy$default$1();
  public int copy$default$2();
  public java.lang.String productPrefix();
  public int productArity();
  public java.lang.Object productElement(int);
  public scala.collection.Iterator<java.lang.Object> productIterator();
  public boolean canEqual(java.lang.Object);
  public java.lang.String productElementName(int);
  public int hashCode();
  public java.lang.String toString();
  public boolean equals(java.lang.Object);
  public Book(java.lang.String, int);
}
```

## Multiparadigm Language

多模式语言。

Scala 为程序员提供了两全其美的体验。动态语言的使用者会发现 Scala 简洁的语法和类型推断可以减少在 Java 中所需的代码；函数式编程者将发现 Scala 的强大。

### Object-Oriented Language
```scala
1 + 2 * 3 / x
```
等价于：
```scala
(1).+(((2).*(3))./(x))
```

Scala 不仅是单纯的面向对象语言，也通过 *trait* 优化了 Java 的 OOP。Scala 不支持静态成员，因为静态成员没有实体来关联。相反，Scala 类能提供单例对象（Singleton object），单例对象使用 *object* 关键字声明：
```scala
object HelloWorld {
  def greet() {
    println("Hello World!")
  }
}
```
### Functional Language

一个简单的函数：
```scala
(i: Int) => { i * i }
```
将函数赋值到变量：
```scala
val square = (i: Int) => { i * i }
```
调用该函数：
```scala
square(3)
```


## Interoperability and Seamless Integration with Java
## Language for the Java Virtual Machine

- Languages designed for the JVM, such as Clojure, Groovy, Java, and Scala.
- Existing languages ported to theJVM, such as JRuby, Jython, and Rhino.

# Installing Scala
```
> java -version
java version "1.8.0_241"
Java(TM) SE Runtime Environment (build 1.8.0_241-b07)
Java HotSpot(TM) 64-Bit Server VM (build 25.241-b07, mixed mode)
```


```
> scala --version
Scala code runner version 2.13.1-20191225-230744-unknown -- Copyright 2002-2019, LAMP/EPFL and Lightbend, Inc.
```

# Scala at the Command Line and Scala Scripts
Scala 提供了三种方式来运行程序：
- REPL 交互。
- 单文件的 Scala 脚本。
- 编译成 JAR 文件。

## Interactive Scala
```scala
> scala
Welcome to Scala 2.13.1-20191225-230744-unknown (Java HotSpot(TM) 64-Bit Server VM, Java 1.8.0_241).
Type in expressions for evaluation. Or try :help.

scala> 1 + 1
res0: Int = 2

scala> res0 * 8
res1: Int = 16

scala> println("Hello World!");
Hello World!

scala> val x = "Hello world"
x: String = Hello world

scala> var x1 = x.length
x1: Int = 11

scala> import java.util._
import java.util._

scala> val d = new Date
d: java.util.Date = Sun Apr 12 22:43:48 CST 2020

scala> :paste
// Entering paste mode (ctrl-D to finish)

val v = 5
if (v==5)
  print("true ")
else
  print("false ")

// Exiting paste mode, now interpreting.

true v: Int = 5

scala> :quit
```

## Scala Scripts
`HelloWorld.scala`:
```scala
println("Hello World!")
```
```
> scala HelloWorld.scala
Hello World!
```
## Compiling Scala Programs
```
> scalac File1.scala File2.scala
> fsc File1.scala File2.scala
```

# Your First Scala Programs

## Hello World
```scala
object HelloWorld {
    def main(args: Array[String]): Unit {
        println("Hello,World!")
    }
}
```

## Printing Some Numbers
```scala
for {i <- 1 to10}
    println(i)
```
```scala
for {i <- 1 to 10; j <- 1 to10}
  println(i* j)
```
